#include <stdio.h>//необходимо для printf
#include <string.h>//необходимо для puts
int main()
{
    setlocale (LC_ALL, "Russian");
/*инициализируем переменные*/
int i=0, n=0, k;
int d;
char alf[] = "АБВГДЕЁЖЗИЙКЛМНОПРСТ — т 21	У — у 22	Ф — ф 23	Х — х 24	Ц — ц 25	Ч — ч 26	Ш — ш 27	Щ — щ 28	Ъ — ъ 29	Ы — ы 30	Ь — ь 31	Э — э 32	Ю — ю 33	Я — я//словарь
char buf[10];//массив для ввода сообщения
char decod[10];//массив для ввода сообщения
/*Процедура шифрования ввод*/
printf("\n***Шифроввание***");
printf("\nВведите слово:");
scanf("%s",&buf);//ввод слова или цифр
printf("\nвведите цифровой ключ, (шаг от 1 до 10):  ");
scanf("%i",&k);//вводим ключ
for (n=0; n < 10; n++)
{
for (i = 0; i < 47; i++)
{
if (buf[n] == alf[i])
{
if (i >= 47)
buf[n] = alf[i-47];
else
buf[n] = alf[i+k];//сдвигаем вправо на показания шага ключа
break;//принудительно выходим из цикла
}
}
}
printf("\nВаш шифр= %s\n", buf);//выводим полученный шифр
scanf("%s", char *decod);//вводим шифр
printf("\nВведите цифровой ключ, (шаг от 1 до 10): ");
scanf("%i",&d);//вводим ключ
for (n=0; n < 10; n++)
{
for (i = 0; i < 47; i++)
{
if (decod[n] == alf[i])
{
if (i >= 47)
decod[n] = alf[i-47];
else
decod[n] = alf[i-d];//сдвигаем влево на показания шага ключа
break;//принудительно выходим из цикла
}
}
}
printf("\nШифр= ");
puts (decod);//выводим кодgetch();//задержка программы
return 0;
}