// Арифметика покажчиків
// Додавання або віднімання числа n до покажчика зсуває адресу, на яку вказує покажчик, на певну кількість байтів. Кількість байтів вираховується за формулою:

// n * sizeof(<тип покажчика>)
// У нижченаведеному коді ми використовуємо покажчики, щоб дізнатись довжину рядка. У циклі ми створюємо покажчик, і на кожній ітерації циклу зсуваємо покажчик на наступний символ у рядку.
#include <stdio.h>

int main(void)
{
  char* str = "happy cat";
  int counter = 0;
  for (char* ptr = str; *ptr != '\0'; ptr++)
  {
    counter++;
  }
  printf("%d\n", counter);
}